In [5]:
import numpy as np
import pandas as pd
data=pd.read_csv("DETAILS.csv")
print(data)

           NAME  AGE  SALARY  GENDER DEPARTMENT
0  M.pravallika   18  30,000  female        CSE
1     M.Manusha   22  45,000  female        NAN
2   M.Gnanendra   24  50,000    Male        MBA
3       M.Kiran   20  30,100    Male        ITI

In [6]:
data.isnull()

    NAME    AGE  SALARY  GENDER  DEPARTMENT
0  False  False   False   False       False
1  False  False   False   False       False
2  False  False   False   False       False
3  False  False   False   False       False

In [7]:
data.notnull()

   NAME   AGE  SALARY  GENDER  DEPARTMENT
0  True  True    True    True        True
1  True  True    True    True        True
2  True  True    True    True        True
3  True  True    True    True        True

In [8]:
data.isnull().sum()

NAME          0
AGE           0
SALARY        0
GENDER        0
DEPARTMENT    0
dtype: int64

In [9]:
df=data
df.fillna(0)

           NAME  AGE  SALARY  GENDER DEPARTMENT
0  M.pravallika   18  30,000  female        CSE
1     M.Manusha   22  45,000  female        NAN
2   M.Gnanendra   24  50,000    Male        MBA
3       M.Kiran   20  30,100    Male        ITI

In [11]:
df1=data
df1.fillna(method="bfill")
df1

           NAME  AGE  SALARY  GENDER DEPARTMENT
0  M.pravallika   18  30,000  female        CSE
1     M.Manusha   22  45,000  female        NAN
2   M.Gnanendra   24  50,000    Male        MBA
3       M.Kiran   20  30,100    Male        ITI

In [12]:
df1.dropna()

           NAME  AGE  SALARY  GENDER DEPARTMENT
0  M.pravallika   18  30,000  female        CSE
1     M.Manusha   22  45,000  female        NAN
2   M.Gnanendra   24  50,000    Male        MBA
3       M.Kiran   20  30,100    Male        ITI